/*
  Для закрепления материала предлагается сделать аналог Trello или ToDoIst.
  
  В проекте использовать Реляционную бд (тк  в курсе указана нереляционная)

  На каждом этапе начиная с ORM  будет выполнятся проект.
  Этапы
  1) Инициализация, установка необходимых пакетов, формирование схемы базы данных, содание модулей и первых запросов.
  2) Подключение ОRM (TypeORM, Prisma, Sequilize). Рекоменду TypeORM - на нём могу показать больше инетересных вещей. 
    Формирование моделей бд (схемы бд) и  привязка к модулям и сервисам)
  3) Добавление аунтетификации (рекомендуется JWT).
  4) Распределение роле  и создание Guards для  доступа к эндпоинтам (контроллер)
  5) Документирование кода - подключение свагера
  6-7) Логирование и обработка ошибок.
  8) Добавление логики  для загрузки файлов (картинок), подключение библиотеки sharp
  
  Деление на микросервисы будет происходить позже. Когда будет добавлена email рассылка или websockets
*/
