// Теория
// https://learn.javascript.ru/regular-expressions

// Шпаргалка
// https://proglib.io/p/shpargalka-po-regulyarnym-vyrazheniyam-v-javascript-2022-07-17

// сайт где можно тестить регулярные выражения
// https://regex101.com/


/*
To Do:
1)Дана строка '23 + 35 ='. Числа могут быть любыми. Выведите на экран результат операции в виде '23 + 35 = 58'.
2) Дана строка 'aba accca azzza wwwwa'. Напишите регулярку, которая найдет все строки по краям 
    которых стоят буквы 'a', и заменит каждую из них на '!'. Между буквами a может быть любой символ (кроме a).



  Необязательно к выполнению (но было бы хорошо, если выполнил(а))
  3) Есть большой HTML. С помощью регулянрного выражения нужно найти все слова "height".
*/
